Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.cloudflare_zone.bryanwp: Read complete after 0s [id=d2287afe1d6fbddb1a27e1a5b85b0288]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # proxmox_virtual_environment_file.debian_container_template will be destroyed
  # (because resource uses count or for_each)
- resource "proxmox_virtual_environment_file" "debian_container_template" {
      - content_type           = "iso" -> null
      - datastore_id           = "backup-nas" -> null
      - file_modification_date = "2023-10-07T12:04:58Z" -> null
      - file_name              = "debian-12.2.0-amd64-netinst.iso" -> null
      - file_size              = 658505728 -> null
      - id                     = "backup-nas:iso/debian-12.2.0-amd64-netinst.iso" -> null
      - node_name              = "prox2" -> null
      - overwrite              = true -> null
      - timeout_upload         = 1800 -> null

      - source_file {
          - changed  = false -> null
          - insecure = false -> null
          - path     = "https://cdimage.debian.org/debian-cd/current/amd64/iso-cd/debian-12.2.0-amd64-netinst.iso" -> null
        }
    }

  # proxmox_virtual_environment_file.debian_container_template["0"] will be created
+ resource "proxmox_virtual_environment_file" "debian_container_template" {
      + content_type           = "iso"
      + datastore_id           = "backup-nas"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "prox2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_file {
          + changed  = false
          + insecure = false
          + path     = "https://cdimage.debian.org/debian-cd/current/amd64/iso-cd/debian-12.2.0-amd64-netinst.iso"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://c4f00d43b117:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`